app/views/scholar_queries/index.html.erb

        <td><%= scholar_query.query_time || scholar_query.created_at %></td>
        <td><span class="badge"><%= scholar_query.query_clicks.count %></span></td>
---
SELECT COUNT(*) FROM "query_clicks" WHERE "query_clicks"."scholar_query_id" = ?  [["scholar_query_id", 9]]