app/views/scholar_queries/show.html.erb

SELECT "query_clicks".* FROM "query_clicks" WHERE "query_clicks"."scholar_query_id" = ?  [["scholar_query_id", 6]]
SELECT COUNT(*) FROM "query_clicks" WHERE "query_clicks"."scholar_query_id" = ?  [["scholar_query_id", 9]]
---
</p>
<h2><%= pluralize(@scholar_query.query_clicks.count, "Link") %> clicked</h2>