app/views/users/index.html.erb

SELECT COUNT(*) FROM "scholar_queries" WHERE "scholar_queries"."user_id" = ?  [["user_id", 6]]
---
        <td><%= user.get_url %></td>
        <td><%= user.scholar_queries.count %></td>