app/views/users/show.html.erb

SELECT "scholar_queries".* FROM "scholar_queries" WHERE "scholar_queries"."user_id" = ?  [["user_id", 6]]
SELECT COUNT(*) FROM "scholar_queries" WHERE "scholar_queries"."user_id" = ?  [["user_id", 6]]
---
</p>
<h2><%= pluralize(@user.scholar_queries.count, "Query") %></h2>

SELECT COUNT(*) FROM "query_clicks" WHERE "query_clicks"."scholar_query_id" = ?  [["scholar_query_id", 23]]
---
        <td><%= scholar_query.created_at %></td>
        <td><%= scholar_query.query_clicks.count %>