app/controllers/api_controller.rb

SELECT "users".* FROM "users" WHERE "users"."token" = 'fced0c7d68' ORDER BY "users"."id" ASC LIMIT 1
---
	def user_search

		user = User.all.find_by_token(params[:token])