app/controllers/query_clicks_controller.rb

  def index
    @query_clicks = QueryClick.all
---
SELECT "query_clicks".* FROM "query_clicks"

  def create
    query_click = QueryClick.new(scholar_query_id: params[:scholar_query_id], heading: params[:heading], synopsis: params[:synopsis], link_location: params[:link_location], sitations: params[:sitations], location: params[:location], authors: params[:authors], click_time: params[:click_time])
    query_click.save
---
INSERT INTO "query_clicks" ("authors", "created_at", "heading", "link_location", "location", "scholar_query_id", "sitations", "synopsis", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @query_click.destroy
---
DELETE FROM "query_clicks" WHERE "query_clicks"."id" = ?  [["id", 1]]

    def set_query_click
      @query_click = QueryClick.find(params[:id])
---
SELECT "query_clicks".* FROM "query_clicks" WHERE "query_clicks"."id" = ? LIMIT 1  [["id", "1"]]