app/controllers/scholar_queries_controller.rb

  def index
    @scholar_queries = ScholarQuery.all
---
SELECT "scholar_queries".* FROM "scholar_queries"

  def create
    @scholar_query = ScholarQuery.new(query_text: params[:query_text], user_id: session[:user_id], task_report_id: params[:task_report_id])
    @scholar_query.save
---
INSERT INTO "scholar_queries" ("created_at", "query_text", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 16 May 2014 05:59:00 UTC +00:00], ["query_text", "big data"], ["updated_at", Fri, 16 May 2014 05:59:00 UTC +00:00], ["user_id", 6]]

  def destroy
    @scholar_query.destroy
---
DELETE FROM "scholar_queries" WHERE "scholar_queries"."id" = ?  [["id", 2]]

  def feedback
    query = ScholarQuery.find(params[:query_id])
    query.update(satisfaction: params[:satisfaction], broadness: params[:broadness])
---
SELECT "scholar_queries".* FROM "scholar_queries" WHERE "scholar_queries"."id" = ? LIMIT 1  [["id", "56"]]
UPDATE "scholar_queries" SET "satisfaction" = ?, "broadness" = ?, "updated_at" = ? WHERE "scholar_queries"."id" = 56  [["satisfaction", 3], ["broadness", 2], ["updated_at", Fri, 16 May 2014 09:52:01 UTC +00:00]]

    def set_scholar_query
      @scholar_query = ScholarQuery.find(params[:id])
---
SELECT "scholar_queries".* FROM "scholar_queries" WHERE "scholar_queries"."id" = ? LIMIT 1  [["id", "2"]]