app/controllers/users_controller.rb

  def create

    token = (0...6).map { ('a'..'z').to_a[rand(26)] }.join
    until(User.all.find_by_token(token).nil?)
      token = (0...6).map { ('a'..'z').to_a[rand(26)] }.join
    end

    @user = User.new(name: params[:user][:name], token: token)
    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."token" = '54a8092b8c' LIMIT 1
INSERT INTO "users" ("created_at", "name", "token", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 16 May 2014 05:17:59 UTC +00:00], ["name", "simo"], ["token", "fced0c7d68"], ["updated_at", Fri, 16 May 2014 05:17:59 UTC +00:00]]

  def download_data
    user_id = params[:user_id]
    user = User.find(user_id)

    data = ""

    queries = user.scholar_queries
    query_clicks = {}
    queries.each do |query|
      query_clicks[query.id] = 0
    end

    data += queries.map{ |q| q.query_text }.join(",")
    data += "\n"

    for round in 1..100
      round_values = ""

      queries.each do |query|
        if( not QueryClick.where(scholar_query_id: query.id, location: round).empty? )
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "15"]]
SELECT "scholar_queries".* FROM "scholar_queries" WHERE "scholar_queries"."user_id" = ?  [["user_id", 15]]
SELECT "query_clicks".* FROM "query_clicks" WHERE "query_clicks"."scholar_query_id" = ?  [["scholar_query_id", 215]]
SELECT COUNT(*) FROM "query_clicks" WHERE "query_clicks"."scholar_query_id" = 215 AND "query_clicks"."location" = 1

  def admin_login_check
    a = Admin.all.where(name: params[:admin][:name]).first
---
SELECT "admins".* FROM "admins" WHERE "admins"."name" = 'admin' ORDER BY "admins"."id" ASC LIMIT 1