app/controllers/users_controller.rb

SELECT "scholar_queries".* FROM "scholar_queries" WHERE "scholar_queries"."user_id" = ?  [["user_id", 6]]
---
  def show
    @user = User.includes(task_reports: [:task, :scholar_queries]).find(params[:id])